content/posts/Becoming_as_inference.md
+++
title = "Becoming as inference"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:02-04:00
slug = "Becoming_as_inference"
draft = false
+++

## [philosophy]({{< relref "philosophy" >}}), [dynamical systems]({{< relref "dynamical_systems" >}}), [process philosophy]({{< relref "process_philosophy" >}}), [pragmatism]({{< relref "pragmatism" >}}), [probabilistic inference]({{< relref "probabilistic_inference" >}}), [physics]({{< relref "physics" >}}), [statistical physics]({{< relref "statistical_physics" >}}) {#philosophy--philosophy-dot-md--dynamical-systems--dynamical-systems-dot-md--process-philosophy--process-philosophy-dot-md--pragmatism--pragmatism-dot-md--probabilistic-inference--probabilistic-inference-dot-md--physics--physics-dot-md--statistical-physics--statistical-physics-dot-md}


## historical note {#historical-note}


### I originally connected these ideas on <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-07-13 Mon&gt; </span></span> and decided to continue this line of thinking under the title of this page [Becoming as inference]({{< relref "Becoming_as_inference" >}}) on <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-07-20 Mon&gt;</span></span>. {#i-originally-connected-these-ideas-on-dot}


## brief description {#brief-description}


### If we just try to describe what scientists do without examining the internal experience they have, then we think of them as constructing models and performing Bayesian model selection and parametric inference. In addition to this explicit application of [probabilistic inference]({{< relref "probabilistic_inference" >}}), we also have a model of the implicit functioning of the brain that considers it as a device that performs [probabilistic inference]({{< relref "probabilistic_inference" >}}), which has been associated with several different names including the [predictive coding model]({{< relref "predictive_coding_model" >}}), [Bayesian brain hypothesis]({{< relref "Bayesian_brain_hypothesis" >}}), [prediction error minimization]({{< relref "prediction_error_minimization" >}}) framework, or the [free energy principle]({{< relref "free_energy_principle" >}}). If we consider the functioning of simple organisms in this same context, we can construct an analogy to the [Bayesian brain hypothesis]({{< relref "Bayesian_brain_hypothesis" >}}) that results in various additional Bayesian \`X\` hypotheses such as the [Bayesian biology hypothesis]({{< relref "Bayesian_biology_hypothesis" >}}), the [Bayesian chemistry hypothesis]({{< relref "Bayesian_chemistry_hypothesis" >}}), [Quantum Bayesianism]({{< relref "Quantum_Bayesianism" >}}), and so on. {#if-we-just-try-to-describe-what-scientists-do-without-examining-the-internal-experience-they-have-then-we-think-of-them-as-constructing-models-and-performing-bayesian-model-selection-and-parametric-inference-dot-in-addition-to-this-explicit-application-of-probabilistic-inference--probabilistic-inference-dot-md--we-also-have-a-model-of-the-implicit-functioning-of-the-brain-that-considers-it-as-a-device-that-performs-probabilistic-inference--probabilistic-inference-dot-md--which-has-been-associated-with-several-different-names-including-the-predictive-coding-model--predictive-coding-model-dot-md--bayesian-brain-hypothesis--bayesian-brain-hypothesis-dot-md--prediction-error-minimization--prediction-error-minimization-dot-md--framework-or-the-free-energy-principle--free-energy-principle-dot-md--dot-if-we-consider-the-functioning-of-simple-organisms-in-this-same-context-we-can-construct-an-analogy-to-the-bayesian-brain-hypothesis--bayesian-brain-hypothesis-dot-md--that-results-in-various-additional-bayesian-x-hypotheses-such-as-the-bayesian-biology-hypothesis--bayesian-biology-hypothesis-dot-md--the-bayesian-chemistry-hypothesis--bayesian-chemistry-hypothesis-dot-md--quantum-bayesianism--quantum-bayesianism-dot-md--and-so-on-dot}

On one hand this suggests that developing a sufficiently flexible framework for describing the processes within which [probabilistic inference]({{< relref "probabilistic_inference" >}}) occurs is potentially fundamental. On another, it may be that at this level of abstraction doing so would eventually appear vacuous.


### pan-inferentialism, the notion that [probabilistic inference]({{< relref "probabilistic_inference" >}}) is embodied by [dynamical systems]({{< relref "dynamical_systems" >}}) and unifies the curiosity of humans as manifest in the experience of scientists with the models they create of the functioning of physical and biological systems {#pan-inferentialism-the-notion-that-probabilistic-inference--probabilistic-inference-dot-md--is-embodied-by-dynamical-systems--dynamical-systems-dot-md--and-unifies-the-curiosity-of-humans-as-manifest-in-the-experience-of-scientists-with-the-models-they-create-of-the-functioning-of-physical-and-biological-systems}


## key references {#key-references}


### [philosophy]({{< relref "philosophy" >}}) {#philosophy--philosophy-dot-md}

<!--list-separator-->

-  [process philosophy a survey of basic issues by Nicholas Rescher in 2000]({{< relref "process_philosophy_a_survey_of_basic_issues_by_Nicholas_Rescher_in_2000" >}})

<!--list-separator-->

-  [Articulating reasons An introduction to inferentialism by Robert Brandom in 2000]({{< relref "Articulating_reasons_An_introduction_to_inferentialism_by_Robert_Brandom_in_2000" >}})

<!--list-separator-->

-  [pragmatism in philosophical inquiry by Nicholas Rescher in 2016]({{< relref "pragmatism_in_philosophical_inquiry_by_Nicholas_Rescher_in_2016" >}})

<!--list-separator-->

-  [Pragmatism, Objectivity, and Experience by Steven Levine in 2019]({{< relref "Pragmatism,_Objectivity,_and_Experience_by_Steven_Levine_in_2019" >}})


### [stochastic processes]({{< relref "stochastic_processes" >}}) and [statistical physics]({{< relref "statistical_physics" >}}) {#stochastic-processes--stochastic-processes-dot-md--and-statistical-physics--statistical-physics-dot-md}

<!--list-separator-->

-  [Information, physics, and computation by Marc Mezard and Andrea Montanari in 2009]({{< relref "Information,_physics,_and_computation_by_Marc_Mezard_and_Andrea_Montanari_in_2009" >}})

<!--list-separator-->

-  [Master equations and the theory of stochastic path integrals by Markus Weber and Erwin Frey in 2017]({{< relref "Master_equations_and_the_theory_of_stochastic_path_integrals_by_Markus_Weber_and_Erwin_Frey_in_2017" >}})

<!--list-separator-->

-  [The information geometry of 2-field functional integrals by Eric Smith in 2019]({{< relref "The_information_geometry_of_2-field_functional_integrals_by_Eric_Smith_in_2019" >}})


### [probabilistic inference]({{< relref "probabilistic_inference" >}}) {#probabilistic-inference--probabilistic-inference-dot-md}

<!--list-separator-->

-  [The Helmholtz Machine by Peter Dayan, Geoffrey Hinton, Radford Neal, and Richard Zemel in 1995]({{< relref "The_Helmholtz_Machine_by_Peter_Dayan,_Geoffrey_Hinton,_Radford_Neal,_and_Richard_Zemel_in_1995" >}})

<!--list-separator-->

-  [Regression and Other Stories by Andrew Gelman, Jennifer Hill, and Aki Vehtari in 2020]({{< relref "Regression_and_Other_Stories_by_Andrew_Gelman,_Jennifer_Hill,_and_Aki_Vehtari_in_2020" >}})

<!--list-separator-->

-  [Pattern recognition and machine learning by Chris Bishop in 2006]({{< relref "Pattern_recognition_and_machine_learning_by_Chris_Bishop_in_2006" >}})

<!--list-separator-->

-  [A tutorial on the free-energy framework for modeling perception and learning by Rafal Bogacz in 2017]({{< relref "A_tutorial_on_the_free-energy_framework_for_modeling_perception_and_learning_by_Rafal_Bogacz_in_2017" >}})

<!--list-separator-->

-  [The free energy principle for action and perception A mathematical review by Christopher Buckley, Anil Seth, et al in 2017]({{< relref "The_free_energy_principle_for_action_and_perception_A_mathematical_review_by_Christopher_Buckley,_Anil_Seth,_et_al_in_2017" >}})

<!--list-separator-->

-  [A free energy principle for a particular physics by Karl Friston in 2019]({{< relref "A_free_energy_principle_for_a_particular_physics_by_Karl_Friston_in_2019" >}})


### [Bayesian brain hypothesis]({{< relref "Bayesian_brain_hypothesis" >}}) {#bayesian-brain-hypothesis--bayesian-brain-hypothesis-dot-md}

<!--list-separator-->

-  [The Helmholtz Machine by Peter Dayan, Geoffrey Hinton, Radford Neal, and Richard Zemel in 1995]({{< relref "The_Helmholtz_Machine_by_Peter_Dayan,_Geoffrey_Hinton,_Radford_Neal,_and_Richard_Zemel_in_1995" >}})

<!--list-separator-->

-  [The predictive mind by Jakob Hohwy in 2013]({{< relref "The_predictive_mind_by_Jakob_Hohwy_in_2013" >}})

<!--list-separator-->

-  [Expanding the Active Inference Landscape More Intrinsic Motivations in the Perception-Action Loop by Martin Biehl, Daniel Polani, et al in 2018]({{< relref "Expanding_the_Active_Inference_Landscape_More_Intrinsic_Motivations_in_the_Perception-Action_Loop_by_Martin_Biehl,_Daniel_Polani,_et_al_in_2018" >}})

<!--list-separator-->

-  [Geometry of Friston's active inference by Martin Biehl in 2018]({{< relref "Geometry_of_Friston's_active_inference_by_Martin_Biehl_in_2018" >}})


### [systems biology]({{< relref "systems_biology" >}}) {#systems-biology--systems-biology-dot-md}

<!--list-separator-->

-  [An Introduction to Systems Biology by Uri Alon in 2020]({{< relref "An_Introduction_to_Systems_Biology_by_Uri_Alon_in_2020" >}})


## outline {#outline}


### I. The fundamental role of dynamics in our understanding of the world {#i-dot-the-fundamental-role-of-dynamics-in-our-understanding-of-the-world}

<!--list-separator-->

-  pragmatic [process philosophy]({{< relref "process_philosophy" >}}) derived from [Nicholas Rescher]({{< relref "Nicholas_Rescher" >}})


### II. Modeling phenomena within the framework of probabilistic inference {#ii-dot-modeling-phenomena-within-the-framework-of-probabilistic-inference}


### III. The scientist's experience of inference and the scientist's experience as inference {#iii-dot-the-scientist-s-experience-of-inference-and-the-scientist-s-experience-as-inference}

<!--list-separator-->

-  [Martin Biehl]({{< relref "Martin_Biehl" >}})'s [active inference]({{< relref "active_inference" >}}) synthesizes the [predictive coding model]({{< relref "predictive_coding_model" >}}) of [The Helmholtz Machine by Peter Dayan, Geoffrey Hinton, Radford Neal, and Richard Zemel in 1995]({{< relref "The_Helmholtz_Machine_by_Peter_Dayan,_Geoffrey_Hinton,_Radford_Neal,_and_Richard_Zemel_in_1995" >}}), [Karl Friston]({{< relref "Karl_Friston" >}})'s [free energy principle]({{< relref "free_energy_principle" >}}), [Jakob Hohwy]({{< relref "Jakob_Hohwy" >}})'s [prediction error minimization]({{< relref "prediction_error_minimization" >}}) framework all of which have previously been associated with the [Bayesian brain hypothesis]({{< relref "Bayesian_brain_hypothesis" >}}).


### IV. The unfolding of phenomena manifests embodied inference {#iv-dot-the-unfolding-of-phenomena-manifests-embodied-inference}
